list0 = [" ", "A","B","C","Ç","D","E","F","G","Ğ","H","İ","I","J","K","L","M","N","O","Ö","P","Q","R","S","Ş","T","U","Ü",
         "V","W","X","Y","Z",'a', 'b', 'c', 'ç', 'd', 'e', 'f', 'g', 'ğ', 'h', 'i̇', 'i', 'j', 'k', 'l', 'm', 'n', 'o',
         'ö', 'p', 'q', 'r', 's', 'ş', 't', 'u', 'ü', 'v', 'w', 'x', 'y', 'z']
list1 = [" ", 'z', 'w', 'Y', '*', 'p', '=', 'N', 'v', '@', 'p', '0', 'e', 'M', '7', 't', 'b', 'u', 'a', 'P', 'ğ', 'J', 'Z', '2',
         'q', 'n', '9', 'g', 'c', 'f', 's', 's', '4', '~', 'R', ';', '9', 'M', ',', '+', 'C', '.', 'F', 'p', 'Z', ']', ')',
         '9', 'P', 'c', '1', '#', 'E', 'a', 'o', 'f', '6', 'a', 'q', 't', 'c', ']', 'M', 'v', 'g']
inp = list(input()) 
length = len(inp)
x = 0
while length > 0:
    for i in list0:
        if i == inp[x]:
            inp[x] = list1[list0.index(i)]
            x += 1
            length -= 1
            break

print("".join(inp))